capillaryRise/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-3;

vertices
(
    (0 0 0)
    (0.5 0 0)
    (19 0 0)
    (20 0 0)
    (20 1 0)
    (20 30 0)
    (19 30 0)
    (19 1 0)
    (0.5 1 0)
    (0.5 30 0)
    (0 30 0)
    (0 1 0)
    (0 0 1)
    (0.5 0 1)
    (19 0 1)
    (20 0 1)
    (20 1 1)
    (20 30 1)
    (19 30 1)
    (19 1 1)
    (0.5 1 1)
    (0.5 30 1)
    (0 30 1)
    (0 1 1)
);

blocks
(
    	hex (0 1 8 11 12 13 20 23) (15 20 1) simpleGrading (1 1 1)
	hex (1 2 7 8 13 14 19 20) (370 20 1) simpleGrading (1 1 1)
	hex (2 3 4 7 14 15 16 19) (20 20 1) simpleGrading (1 1 1)
	hex (7 4 5 6 19 16 17 18) (20 580 1) simpleGrading (1 1 1)
	hex (11 8 9 10 23 20 21 22) (15 580 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            	(8 20 21 9)
		(23 11 10 22)
		(11 23 12 0)
		(16 17 5 4)
		(7 6 18 19)
		(15 16 4 3)
		(12 13 1 0)
		(13 14 2 1)
		(14 15 3 2)
		(7 19 20 8)
        );

    }

    atmosphereR
    {
        type patch;
        faces
        (
  	    (5 17 18 6)
        );
    }

    atmosphereL
    {
        type patch;
        faces
        (
            (9 21 22 10)
        );
    }


    frontAndBack
    {
        type empty;
        faces
        (
            (22 21 20 23)
            (8 9 10 11)
            (0 1 8 11)
            (23 20 13 12)
            (1 2 7 8)
            (20 19 14 13)
            (2 3 4 7)
            (19 16 15 14)
            (4 5 6 7)
            (19 18 17 16)
        );
    }
);

    
// ************************************************************************* //
