capillaryRise/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    walls
    {
        type            wall;
        nFaces          3135;
        startFace       55215;
    }
    atmosphereR
    {
        type            patch;
        nFaces          20;
        startFace       58350;
    }
    atmosphereL
    {
        type            patch;
        nFaces          15;
        startFace       58370;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          56800;
        startFace       58385;
    }
)

// ************************************************************************* //
